<?
/*
Модуль: Мои гости
Версия: 1
Автор: Merin
Аська: 7950048
*/

// удаление гостей которые были 31 день назал
mysql_query("DELETE FROM `my_guest` WHERE `time` < '".(time()-60*60*24*31)."'");
// удаление
mysql_query("DELETE FROM `newid` WHERE `time` <= '".$time."'");
// склонение
function ball($string){
$string=intval($string);
$p=mb_substr($string, -2);
$inp=" баллов";
if($p==2||$p==3||$p==4||$p==22||$p==23||$p==24||$p==32||$p==33||$p==34||$p==42||$p==43||$p==44||$p==52||$p==53||$p==54||$p==62||$p==63||$p==64||$p==72||$p==73||$p==74||$p==82||$p==83||$p==84||$p==92||$p==93||$p==94)$inp=" балла";
if($p==1||$p==21||$p==31||$p==41||$p==51||$p==61||$p==71||$p==81||$p==91)$inp=" балл";
return $string.$inp;
}

?>