<?php
include("func.php");
// CONNECT С БАЗОЙ
$user = "volchlli_troya";////ПОЛЬЗОВАТЕЛЬ
$base = "volchlli_grom";////БАЗА
$pwd = "2096173800";////ПАРОЛЬ
$server = "localhost";////ХОСТ (СЕРВЕР)

$sql = mysql_connect($server, $user, $pwd) or die ("Не могу соединиться с базой!");///СОЕДИНЯЕМСЯ
mysql_select_db($base, $sql) or die ("База $base не найдена!");////ВЫБИРАЕМ БАЗУ
//////
$apanel="cf583fh6kj";////ПАРОЛЬ ОТ АДМИНКИ (ГЛАВНОЙ)
// /////
$query=mysql_query("select * from money");
$ini=mysql_fetch_array($query);
///////////////
$min=$ini["min"];///МИНИМАЛКА
$ref=$ini["ref"];///РЕФ ПРОЦЕНТ
$minmob=10;///МИНИМАЛКА на мобилу
$mobproc=1;///процент за вывод на мобилу
///////ПРИБАВКА К ВЫВОДУ ПРИ ОПРЕДЕЛЕННОМ ТАРИФЕ(%)
$tarif=array(
"premium"=>$ini["premium"],//ЗА ПЕРМИУМ
"gold"=>$ini["gold"]);//ЗА ЗОЛОТОЙ
////////
$money=array(
"1"=>$ini["1"],
"2"=>$ini["2"],
"3"=>$ini["3"],
"4"=>$ini["4"],
"5"=>$ini["5"],
"6"=>$ini["6"],
"7"=>$ini["7"],
"8"=>$ini["8"],
"9"=>$ini["9"],
"10"=>$ini["10"],
"11"=>$ini["11"],
"12"=>$ini["12"],
"13"=>$ini["13"],
"14"=>$ini["14"],
"15"=>$ini["15"],
"16"=>$ini["16"],
"17"=>$ini["17"],
"18"=>$ini["18"],
"19"=>$ini["19"],
"20"=>$ini["20"],
"21"=>$ini["21"],
"22"=>$ini["22"],
"23"=>$ini["23"],
"24"=>$ini["24"],
"25"=>$ini["25"],
"26"=>$ini["26"],
"27"=>$ini["27"],
"28"=>$ini["28"],
"29"=>$ini["29"],
"30"=>$ini["30"],
"31"=>$ini["31"],
"32"=>$ini["32"],
"33"=>$ini["33"],
"34"=>$ini["34"],
"35"=>$ini["35"],
"36"=>$ini["36"],
"37"=>$ini["37"],
"38"=>$ini["38"],
"39"=>$ini["39"],
"40"=>$ini["40"],
"41"=>$ini["41"],
"42"=>$ini["42"],
"43"=>$ini["43"],
"44"=>$ini["44"],
"45"=>$ini["45"],
"46"=>$ini["46"],
"47"=>$ini["47"],
"48"=>$ini["48"],
"49"=>$ini["49"],
"50"=>$ini["50"],
"51"=>$ini["51"],
"52"=>$ini["52"],
"53"=>$ini["53"],
"54"=>$ini["54"],
"55"=>$ini["55"],
"56"=>$ini["56"],
"57"=>$ini["57"],
"58"=>$ini["58"],
"59"=>$ini["59"],
"60"=>$ini["60"],
"61"=>$ini["61"],
"62"=>$ini["62"],
"63"=>$ini["63"],
"64"=>$ini["64"],
"65"=>$ini["65"],
"66"=>$ini["66"],
"67"=>$ini["67"],
"68"=>$ini["68"],
"69"=>$ini["69"],
"70"=>$ini["70"],
"71"=>$ini["71"],
"72"=>$ini["72"],
"73"=>$ini["73"],
"74"=>$ini["74"],
"75"=>$ini["75"],
"76"=>$ini["76"],
"77"=>$ini["77"],
"78"=>$ini["78"],
"79"=>$ini["79"],
"80"=>$ini["80"],
"81"=>$ini["81"],
"82"=>$ini["82"],
"83"=>$ini["83"],
"84"=>$ini["84"],
"85"=>$ini["85"],
"86"=>$ini["86"],
"87"=>$ini["87"],
"88"=>$ini["88"],
"89"=>$ini["89"],
"90"=>$ini["90"],
"91"=>$ini["91"],
"92"=>$ini["92"],
"93"=>$ini["93"],
"94"=>$ini["94"],
"95"=>$ini["95"],
"96"=>$ini["96"],
"97"=>$ini["97"],
"98"=>$ini["98"],
"99"=>$ini["99"],
"100"=>$ini["100"],
"101"=>$ini["101"],
"102"=>$ini["102"],
"103"=>$ini["103"],
"104"=>$ini["104"],
"105"=>$ini["105"],
"106"=>$ini["106"],
"107"=>$ini["107"],
"108"=>$ini["108"],
"109"=>$ini["109"],
"110"=>$ini["110"],
"111"=>$ini["111"],
"112"=>$ini["112"],
"113"=>$ini["113"],
"114"=>$ini["114"],
"115"=>$ini["115"],
"116"=>$ini["116"],
"117"=>$ini["117"],
"118"=>$ini["118"]
);
/////////////
$counter = diz('</a><br/>© grom.volkes.ru', "footer");//////СЮДА ВСТАВЛЯЕМ СЧЕТЧИКИ, БАННЕРЫ И КОПИРАЙТЫ
$hr = '<div class="hr"></div>';//ГОРИЗОНТАЛЬНАЯ ЛИНИЯ
// ////
$site = "http://volkes.ru/grom";////ОПРЕДЕЛИТЕЛЬ АДРЕСА САЙТА
$colzap = 5;///КОЛИЧЕСТВО ЗАПИСЕЙ НА СТРАНИЦЕ (НОВОСТЕЙ, СООБЩЕНИЙ В ЧАТЕ И Т.Д.)
$names = "volkes.ru - живое общение";////СОВЕТУЕМОЕ ИМЯ ССЫЛКИ
$coladv=3;///кол-во внутр. рекл.
$shag=0.05;///минимальный шаг аукциона
?>