<?
/// ПОСЛЕДНЕЕ ОБНОВЛЕНИЕ БАЗЫ IP ОПЕРАТОРОВ - 29.11.09 ///

$oper= trim(htmlspecialchars(stripslashes(@$_GET['oper'])));
$oper = @preg_replace("/[^0-9]/", "", $oper);

if($oper != "")
{
if($oper < 0 or $oper>118)
{
$oper = 0;
}

}else{
if(isset($_SERVER['HTTP_X_FORWADED_FOR']))
{
$ip = $_SERVER['HTTP_X_FORWADED_FOR'];
}
else
{
$ip = @$_SERVER['REMOTE_ADDR'];
}
$ips = split("\.", "$ip");
@$ipnum = $ips[3] + $ips[2] * 256 + $ips[1] * 256 * 256 + $ips[0] * 256 * 256 * 256;
$oper = 0;
//Мегафон (Россия)1
$IP101 = array(1402273792,1402275840,1402277888,1402278912,1402279936,1402281984,1402284032,1402286080,1402287104,1407848448,1427800064,1427801088,1427802112,1427804160,1427805184,1427808256,1427809280,1427812352,1427813376,1427819520,1427824640,3251233792);
$IP201 = array(1402275839,1402276863,1402278911,1402279935,1402280959,1402283007,1402285055,1402287103,1402288127,1407849215,1427801087,1427802111,1427804159,1427804415,1427806207,1427809279,1427810303,1427813375,1427814399,1427819775,1427825663,3251234815);
//Билайн (Россия)2
$IP102 = array(1042388736,1357732496,1385655288,1406984192,1433657344,1505550336,3287253376,3648405504,3648406528,3648408576,3648409600,3648410624,3648411648,3648412672);
$IP202 = array(1042388991,1357732511,1385655295,1406985215,1433657599,1505551359,3287253391,3648406527,3648407551,3648409599,3648410623,3648411647,3648412671,3648413695);
//Utel (Россия)3
$IP103 = array(1489879040,1494507776,1506570240,1519796224,3564676832);
$IP203 = array(1489883135,1494508031,1506574335,1519800319,3564676863);
//БайкалВестКом (Россия)4
$IP104 = array(1347599104,1360162816,1360162816,1360162816,1360163840,1360164352,1407867392,3274599168,3274600448,3588519936);
$IP204 = array(1347599359,1360163839,1360166910,1360166911,1360164351,1360166910,1407867647,3274599423,3274600703,3588520447);
//МТС (Россия)5
$IP105 = array(1347126528,1347674112,1347677184,1360933376,1410457600,1500315648,1535627776,3258356736,3273026560,3276428288,3277188608,3277989440,3287259392,3562834688,3562834880,3578831872,3579248640,3579259392,3579267072,3579268096,3579269120,3641237504,3641237504,3641240576,3645018112,3645566976,3645569280,3645569536,3645569792,3647698432);
$IP205 = array(1347127167,1347678207,1347678207,1360933887,1410459647,1500332031,1535628031,3258357759,3273027583,3276428543,3277188863,3277989503,3287259647,3562834879,3562834943,3578832127,3579258879,3579265535,3579267935,3579268607,3579273215,3641240575,3641241599,3641241599,3645019135,3645569023,3645569535,3645569791,3645570047,3647698687);
//TELE2 (Россия)6
$IP106 = array(1357732464,1404188672,1404210176,1404211200,1404829696,1404837888,1404846080,1404854272,1404862464,1518338048,1518927872,2197028864,3277993032,3566723072,3572996368,3580203520);
$IP206 = array(1357732479,1404189183,1404211199,1404212223,1404837887,1404846079,1404854271,1404862463,1404870655,1519386623,1518944255,2197094399,3277993039,3566723327,3572996383,3580204543);
//МОТИВ (Россия)7
$IP107 = array(3650368256,3650368512);
$IP207 = array(3650368511,3650368767);
//Енисейтелеком (Россия)8
$IP108 = array(1360678912,3278955480,3278960128);
$IP208 = array(1360683007,3278955515,3278960383);
//НСС (Россия)9
$IP109 = array(1310555648,1389383040,1592803328,1592811520,1592815616,3267008512);
$IP209 = array(1310555903,1389383167,1592811519,1592815615,1592817663,3267008767);
//СМАРТС (Россия)10
$IP110 = array(1310210048,1412399104,1412413440,1441609984,3260286336,3645731072);
$IP210 = array(1310211071,1412415487,1412413951,1441610239,3260286463,3645731079);
//СТЕК GSM (Россия)11
$IP111 = array(1388851200,1509527552,3648297984);
$IP211 = array(1388851455,1509528575,3648299007);
//Татинком-Т (Россия)12
$IP112 = array(1481785344,1481787392,1506762752,1506762752,1506763520);
$IP212 = array(1481793535,1481787647,1506763007,1506764799,1506763647);
//Ульяновск GSM (Россия)13
$IP113 = array(1566410752);
$IP213 = array(1566411775);
//НТК (Россия)14
$IP114 = array(1310253056,1358118912,1358119680,1500205056);
$IP214 = array(1310255103,1358119423,1358123007,1500207103);
//SkyLink (Россия)15
$IP115 = array(1311332352,1509752832,1509752832,1536516096,1536519424,1536519936,1536522240,1545863168,1545879552,3247084544,3272918016,3565250560);
$IP215 = array(1311333375,1509756927,1509769215,1536518143,1536519679,1536520191,1536523263,1545879551,1545895935,3247085567,3272918527,3565254655);
///Цифровая экспансия (Россия)16
$IP116 = array(3651751936,3651752192,3651755008);
$IP216 = array(3651752191,3651752447,3651756031);
///ИНДИГО (Таджикистан)17
$IP117 = array(1041252352,3275366400);
        $IP217 = array(1041260543,3275374591);
//Emt (Эстония)18
        $IP118 = array(3645317120);
        $IP218 = array(3645318015);
//Elisa (Эстония)19
        $IP119 = array(3264626688,3268149248,3268149760,3268154880);
        $IP219 = array(3264627711,3268165631,3268150015,3268155135);
//Tele-2 (Эстония)20
        $IP120 = array(1404189184,3580252672);
        $IP220 = array(1404189695,3580254207);
//Bite (Литва)21
        $IP121 = array(3588390912,3588393984,3588400544,3588406784);
        $IP221 = array(3588391935,3588395519,3588400575,3588407295);
//Omnitel (Литва)22
        $IP122 = array(1054132224,1054132224,1054132736,1054133248,3266322432,3266322432,3266327040,3559877376);
        $IP222 = array(1054132479,1054133247,1054132991,1054134271,3266322687,3266330623,3266327295,3559877631);
//Tele-2 (Литва)23
        $IP123 = array(1360860160);
        $IP223 = array(1360861183);
//Tele-2 (Латвия)24
        $IP124 = array(1334173696,1404190720,1404874752,3580214272,3580231680,3580232448,3580236800,3580239360);
        $IP224 = array(1334177536,1404198911,1404875775,3580214783,3580231935,3580233215,3580237567,3580239871);
//Lmt (Латвия)25
        $IP125 = array(3562889216,3562889472,3562890240);
        $IP225 = array(3562889983,3562889727,3562890751);
//Киевстар (Украина)26
  $IP300 = array(1360465920,1360467968,1587085312,3240705024);
  $IP301 = array(1360467967,1360470015,1587150847,3240706047);
//MTS (Украина) 27
  $IP302 = array(1295253504,1295269888,1295302656,1358905344,1358905344,1358907392,1358907648,1358907904,1358908160,1358908416,1358908672,1358908928,1358909184,1406853120,1490436096,1490444288);
  $IP303 = array(1295319039,1295286271,1295319039,1358905471,1358909439,1358907647,1358907903,1358908159,1358908415,1358908671,1358908927,1358909183,1358909439,1406861311,1490444287,1490452479);
//life:) (Украина)28
    $IP304 = array(1333559296,1333559296,1333575680,1486487552,1536278528,1536278528,1536286720,1588723712,3560611840,3560611840,3560612352,3560612864,3560613888,3560615936);
    $IP305 = array(1333575679,1333592063,1333592063,1486553087,1536286719,1536294911,1536294911,1588854783,3560612095,3560620031,3560612863,3560613887,3560615935,3560620031);
//Beeline (Украина))29
    $IP306 = array(3253698560,3588472832);
    $IP307 = array(3253699071,3588489215);
//KCELL (Казахстан)30
    $IP308 = array(3274702592);
    $IP309 = array(3274702847);
//Прибалтийские операторы31
    $IP310 = array(3557661440,3563233536,3583086592);
    $IP311 = array(3557661695,3563233791,3583087103);
//Opera Mini32
//    $IP312 = array(1090499584,1357411584,1540055040,1593212416,3283979776);
//    $IP313 = array(1090499839,1357411839,1540056063,1593212927,3283980287);
//Beeline KZ (Казахстан)33
    $IP314 = array(1296711680,3557661440,3566895104,3566904064,3587391488);
    $IP315 = array(1296711935,3557661695,3566895359,3566904319,3587407871);
//Экстел GSM//34
    $IP316 = array(3557661440);
    $IP317 = array(3557661695);
//Babilon GSM (Таджикистан)35
    $IP318 = array(1336588288,1336588544,3245279744,3641421824,3641422080);
    $IP319 = array(1336590335,1336588607,3245280255,3641425919,3641422335);
//БеСТ (Беларусь)36
    $IP320 = array(1360941056);
    $IP321 = array(1360941823);
//Сотовая Связь Улан-Уде (Россия)37
    $IP322 = array(1357722112,1407844352);
    $IP323 = array(1357722367,1407909887);
// AQUAFON Абхазия-GSM (Россия)38
    $IP324 = array(1052116992,1407549440);
    $IP325 = array(1052119039,1407582207);
//MegaCom KG (Киргизия)39
    $IP326 = array(1427823616);
    $IP327 = array(1427824639);
//Kyrgyztelecom (Киргизия)40
    $IP328 = array(3587391488);
    $IP329 = array(3587407871);
//BiTel (Киргизия)41
    $IP330 = array(3266342656);
    $IP331 = array(3266342911);
//ON GSM (Россия)42
    $IP332 = array(1294467072,1310555648,1314193408,1333657600,1334149120,1357512704,1432166400,1432330240,1441609984,1467473920,1486061568,1486078976,1489534976,1503100928,1508868096,1509867520,1560051712,3558919680);
    $IP333 = array(1294499839,1310555903,1314258943,1333673983,1334157311,1357545471,1432174591,1432334335,1441610239,1467482111,1486073855,1486093823,1489567743,1503117311,1508869119,1509883903,1560084479,3558919935);
//VELCOM (Белорусь)43
    $IP334 = array(1296703488,1296704512);
    $IP335 = array(1296705535,1296705535);
//Алтайсвязь (Россия)44
    $IP336 = array(1359084544,1388849152);
    $IP337 = array(1359084799,1388850175);
//Тамбов GSM (Россия)45
    $IP338 = array(3582427136);
    $IP339 = array(3582431103);
//БашСел (Россия)46
    $IP340 = array(3582431104);
    $IP341 = array(3582434943);
//ДальСвязь (Россия)47
    $IP342 = array(3273026560,1385632000);
    $IP343 = array(3273027583,1385632255);
//Оренбург GSM (Россия)48
    $IP344 = array(1438679040,3582418944);
    $IP345 = array(1438684447,3582422911);
//Скай Мобайл (Россия)49
    $IP346 = array(1438682304);
    $IP347 = array(1438682335);
//УралСвязьИнформ (Россия)50
    $IP348 = array(3266342656);
    $IP349 = array(3266342911);
//MLT (Tаджикистан)51
    $IP350 = array(1336588288,3245296640,3564240896);
    $IP351 = array(1336590335,3245297151,3564241407);
//BiMoCom 52
    $IP352 = array(1402277632);
    $IP353 = array(1402277887);
//K-Mobile 53
    $IP354 = array(1402277376);
    $IP355 = array(1402277631);
//MTN (ЮАР) 54
    $IP356 = array(701497344,701500160,3289116416,3289244672);
    $IP357 = array(701513727,701500415,3289118463,3289245695);
//Cell (ЮАР)55
          $IP358 = array(3289116416);
    $IP359 = array(3289118463);
//Vodacom (ЮАР) 56
          $IP360 = array(3301908480,3301908480);
    $IP361 = array(3301909503,3301912575);
//Magticom (Грузия) 57
          $IP362 = array(1365221376,1365221376,1365222400);
    $IP363 = array(1365222399,1365225471,1365223423);
//Geocell (Грузия)58
           $IP364 = array(1536655360,3561527296,3561527424);
    $IP365 = array(1536659455,3561527423,3561527551);
//Orange (Израиль) 59
          $IP366 = array(3228960768);
    $IP367 = array(3228961791);
//Cellcom (Израиль) 60
          $IP368 = array(1046085632,1358598144,1358598144,3566648512,3566648544,3566652160);
    $IP369 = array(1046151167,1358600191,1358602239,3566648543,3566648575,3566652223);
//Voxtel GSM (Молдова) 61
    $IP370 = array(1592999936,3253712384);
    $IP371 = array(1593008127,3253712895);
//Moldcell (Молдова) 62
          $IP372 = array(1336598528,1336598528,1449840640,1551007744,1586200576,3556818944,3556819200,3556819456,3556819712,3556821248,3556822528,3556823040,3556824320,3556825088,3556825344,3556825856,3556826112,3556826368);
    $IP373 = array(1336599521,1336600575,1449852927,1551040511,1586208767,3556819199,3556819455,3556819711,3556819967,3556821503,3556822783,3556823295,3556824575,3556825343,3556825599,3556826111,3556826367,3556826623);
//GLOBUL (Болгария) 63
    $IP374 = array(1433845760);
    $IP375 = array(1433846015);
//M-TEL GSM (Болгария) 64
          $IP376 = array(3588366336);
    $IP377 = array(3588374527);
//China Mobile (Китай) 65
    $IP378 = array(3548905472,3549134848,3670540288,3670843392,3716329472);
    $IP379 = array(3549429759,3549167615,3671064575,3670867967,3716337663);
//Orange (Румыния) 66
    $IP380 = array(1054471424,1054471936);
    $IP381 = array(1054471679,1054472191);
//Vodafone (Румыния) 67
          $IP382 = array(3253117184);
    $IP383 = array(3253117439);
//Indosat (Индонезия) 68
          $IP384 = array(3395101696);
    $IP385 = array(3395102207);
//proXL (Индонезия) 69
          $IP386 = array(3399020544);
    $IP387 = array(3399020799);
//T-SEL (Индонезия) 70
    $IP388 = array(3389247488,3389248768,3410915328);
    $IP389 = array(3389251583,3389249023,3410919423);
//Orange (Франция) 71
    $IP390 = array(3254619392);
    $IP391 = array(3254619647);
//SFR (Франция) 72
    $IP392 = array(1350402048,3279123456);
    $IP393 = array(1350418431,3279124479);
//Bouygues Telecom (Франция) 73
    $IP394 = array(1053392896,1053395200);
    $IP395 = array(1053393407,1053395455);
//Orange (Великобритания) 74
    $IP396 = array(3240329216);
    $IP397 = array(3240333311);
//O2 (Великобритания) 75
          $IP398 = array(1384417792,1384431616);
    $IP399 = array(1384418047,1384432127);
//T-Mobile (Великобритания) 76
    $IP400 = array(2516451328);
    $IP401 = array(2516516863);
//Dishnet (Индия) 77
    $IP402 = array(977534976);
    $IP403 = array(977567743);
//Vodafone (Великобритания) 78
    $IP404 = array(3568795648);
    $IP405 = array(3568799999);
//HUTCH (Индия) 79
    $IP406 = array(3411542016);
    $IP407 = array(3411550207);
//idEA (Индия) 80
          $IP408 = array(3415312064);
    $IP409 = array(3415312095);
//MTNL (Индия) 81
    $IP410 = array(3418669056,3418882048,3678404608);
    $IP411 = array(3418685439,3418947583,3678535679);
//АКОС (Россия) 82
    $IP412 = array(1294073856,1386348544,1474363392,1500348416,1545961472,3557736448);
    $IP413 = array(1294204927,1386414079,1474396159,1500364799,1545994239,3557744639);
//Airtel (Индия) 83
    $IP414 = array(1969225728,2098392016,2098392960,3415311104);
    $IP415 = array(1969487871,2098392031,2098392975,3415311359);
//Vodafone (Италия) 84
          $IP416 = array(1407188992,1569849344);
    $IP417 = array(1407320063,1569980415);
//Telecom Italia Mobile (Италия) 85
    $IP418 = array(1459617792,3653763072);
    $IP419 = array(1461714943,3654025215);
//T-Mobile (США) 86
    $IP420 = array(1113456640,3493199872);
    $IP421 = array(1113464831,3493240831);
//AT T (США) 87
    $IP422 = array(1114021888,3518439424);
    $IP423 = array(1114030079,3518447615);
//Mobilkom (Австрия) 88
    $IP424 = array(3257957376);
    $IP425 = array(3257961471);
//Azercell Telecom (Aзербайджан) 89
    $IP426 = array(3651710976);
    $IP427 = array(3651715071);
//Bakcell (Aзербайджан) 90
    $IP428 = array(1434714112,1434728704);
    $IP429 = array(1434746879,1434728959);
//Nar Mobile (Aзебайджан) 91
    $IP430 = array(1307865088);
    $IP431 = array(1307865343);
//Topnet 3G (Сербия и Черногория) 92
    $IP432 = array(1307778048);
    $IP433 = array(1307779071);
//TELEKOM SRBIJA (Сербия и Черногория) 93
    $IP434 = array(1294911488,3569876992,3569893632);
    $IP435 = array(1294917631,3569942527,3569893887);
//MOBTEL (Югославия) 94
    $IP436 = array(3644964864);
    $IP437 = array(3644965479);
//Vodafone (Ирландия) 95
          $IP438 = array(3588849664);
    $IP439 = array(3588857855);
//Vipnet (Хорватия) 96
          $IP440 = array(3562758144);
    $IP441 = array(3562765311);
//Vivacell (Армения) 97
    $IP442 = array(1406787584,1406795264);
    $IP443 = array(1406789631,1406795647);
//E-Plus (Германия) 98
    $IP444 = array(3558301696);
    $IP445 = array(3558309887);
//O2 DE (Германия) 99
          $IP446 = array(1383164672,1383168256,1383168512);
    $IP447 = array(1383164927,1383168511,1383169023);
//T-Mobile DE (Германия) 100
          $IP448 = array(1354432512,1354432512,1470103552,1526726656);
    $IP449 = array(1354461183,1354498047,1471848447,1528299519);
//Vodafone DE (Германия) 101
    $IP450 = array(1356988416,1356991488,2332491776);
    $IP451 = array(1356990463,1356991999,2332557311);
//WIND (Италия) 102
          $IP452 = array(2537095168,2538733568);
    $IP453 = array(2537160703,2538799103);
//Eventis (Молдавия) 103
          $IP454 = array(3241071616);
    $IP455 = array(3241071871);
//Vodafone (Испания) 104
    $IP456 = array(1045909504,1045914624);
    $IP457 = array(1045910527,1045914879);
//Orange (Испания) 105
    $IP458 = array(3567684864,3567688256);
    $IP459 = array(3567685119,3567688359);
//Euskaltel (Испания) 106
    $IP460 = array(3567689216);
    $IP461 = array(3567689471);
//R (Испания) 107
    $IP462 = array(3567690752,3567693312,3567703040);
    $IP463 = array(3567690879,3567693567,3567703295);
//Telecable (Испания) 108
          $IP464 = array(3567708160);
    $IP465 = array(3567709183);
//KPN (Голландия) 109
    $IP466 = array(3645361920);
    $IP467 = array(3645362175);
//T-Mobile (Голландия) 110
    $IP468 = array(1048838144,1048920064);
    $IP469 = array(1048903679,1048936447);
//Vodafone (Голландия) 111
    $IP470 = array(1297561600);
    $IP471 = array(1297563647);
//Orange (Голландия) 112
    $IP472 = array(3249279392,3249287760,3249296384);
    $IP473 = array(3249279407,3249287770,3249296639);
//Telfort (Голландия) 113
          $IP474 = array(3249307088);
    $IP475 = array(3249307103);
//Tele2 (Голландия) 114
    $IP476 = array(3249317120,3249317888);
    $IP477 = array(3249317375,3249318399);
//O2 (Чехия) 115
    $IP478 = array(3264703616);
    $IP479 = array(3264703679);
//T-Mobile (Чехия) 116
    $IP480 = array(1494745600,1494747648);
    $IP481 = array(1494745855,1494747903);



        for ($ix=0; $ix<count($IP101); $ix++)        {                if ($ipnum>=$IP101[$ix] && $ipnum<=$IP201[$ix]) $oper = "1";        }
        for ($ix=0; $ix<count($IP102); $ix++)        {                if ($ipnum>=$IP102[$ix] && $ipnum<=$IP202[$ix]) $oper = "2";        }
        for ($ix=0; $ix<count($IP103); $ix++)        {                if ($ipnum>=$IP103[$ix] && $ipnum<=$IP203[$ix]) $oper = "3";        }
        for ($ix=0; $ix<count($IP104); $ix++)        {                if ($ipnum>=$IP104[$ix] && $ipnum<=$IP204[$ix]) $oper = "4";        }
        for ($ix=0; $ix<count($IP105); $ix++)        {                if ($ipnum>=$IP105[$ix] && $ipnum<=$IP205[$ix]) $oper = "5";        }
        for ($ix=0; $ix<count($IP106); $ix++)        {                if ($ipnum>=$IP106[$ix] && $ipnum<=$IP206[$ix]) $oper = "6";        }
        for ($ix=0; $ix<count($IP107); $ix++)        {                if ($ipnum>=$IP107[$ix] && $ipnum<=$IP207[$ix]) $oper = "7";        }
        for ($ix=0; $ix<count($IP108); $ix++)        {                if ($ipnum>=$IP108[$ix] && $ipnum<=$IP208[$ix]) $oper = "8";        }
        for ($ix=0; $ix<count($IP109); $ix++)        {                if ($ipnum>=$IP109[$ix] && $ipnum<=$IP209[$ix]) $oper = "9";        }
        for ($ix=0; $ix<count($IP110); $ix++)        {                if ($ipnum>=$IP110[$ix] && $ipnum<=$IP210[$ix]) $oper = "10";        }
         for ($ix=0; $ix<count($IP111); $ix++)        {                if ($ipnum>=$IP111[$ix] && $ipnum<=$IP211[$ix]) $oper = "11";        }
        for ($ix=0; $ix<count($IP112); $ix++)        {                if ($ipnum>=$IP112[$ix] && $ipnum<=$IP212[$ix]) $oper = "12";        }
        for ($ix=0; $ix<count($IP113); $ix++)        {                if ($ipnum>=$IP113[$ix] && $ipnum<=$IP213[$ix]) $oper = "13";        }
        for ($ix=0; $ix<count($IP114); $ix++)        {                if ($ipnum>=$IP114[$ix] && $ipnum<=$IP214[$ix]) $oper = "14";        }
        for ($ix=0; $ix<count($IP115); $ix++)        {                if ($ipnum>=$IP115[$ix] && $ipnum<=$IP215[$ix]) $oper = "15";        }
        for ($ix=0; $ix<count($IP116); $ix++)        {                if ($ipnum>=$IP116[$ix] && $ipnum<=$IP216[$ix]) $oper = "16";        }
        for ($ix=0; $ix<count($IP117); $ix++)        {                if ($ipnum>=$IP117[$ix] && $ipnum<=$IP217[$ix]) $oper = "17";        }
        for ($ix=0; $ix<count($IP118); $ix++)        {                if ($ipnum>=$IP118[$ix] && $ipnum<=$IP218[$ix]) $oper = "18";        }
        for ($ix=0; $ix<count($IP119); $ix++)        {                if ($ipnum>=$IP119[$ix] && $ipnum<=$IP219[$ix]) $oper = "19";        }
        for ($ix=0; $ix<count($IP120); $ix++)        {                if ($ipnum>=$IP120[$ix] && $ipnum<=$IP220[$ix]) $oper = "20";        }
        for ($ix=0; $ix<count($IP121); $ix++)        {                if ($ipnum>=$IP121[$ix] && $ipnum<=$IP221[$ix]) $oper = "21";        }
        for ($ix=0; $ix<count($IP122); $ix++)        {                if ($ipnum>=$IP122[$ix] && $ipnum<=$IP222[$ix]) $oper = "22";        }
        for ($ix=0; $ix<count($IP123); $ix++)        {                if ($ipnum>=$IP123[$ix] && $ipnum<=$IP223[$ix]) $oper = "23";        }
        for ($ix=0; $ix<count($IP124); $ix++)        {                if ($ipnum>=$IP124[$ix] && $ipnum<=$IP224[$ix]) $oper = "24";        }
        for ($ix=0; $ix<count($IP125); $ix++)        {                if ($ipnum>=$IP125[$ix] && $ipnum<=$IP225[$ix]) $oper = "25";        }
        for ($ix=0; $ix<count($IP300); $ix++)        {   if ($ipnum>=$IP300[$ix] && $ipnum<=$IP301[$ix]) $oper = "26"; }
  for ($ix=0; $ix<count($IP302); $ix++) {   if ($ipnum>=$IP302[$ix] && $ipnum<=$IP303[$ix]) $oper = "27"; }
  for ($ix=0; $ix<count($IP304); $ix++)        {   if ($ipnum>=$IP304[$ix] && $ipnum<=$IP305[$ix]) $oper = "28"; }
  for ($ix=0; $ix<count($IP306); $ix++)        {   if ($ipnum>=$IP306[$ix] && $ipnum<=$IP307[$ix]) $oper = "29"; }
 //////
//                             -----UTEL-UA-----
///94.179.152.0-94.179.159.255
if($ips[0]==94 && $ips[1]==179 && $ips[2]>=152 && $ips[2]<=159 && $ips[3]>=0 && $ips[3]<=255 )$oper = "30";
///94.178.0.0-94.179.255.255
if($ips[0]==94 && $ips[1]>=178 && $ips[1]<=179 &&$ips[2]>=0 && $ips[2]<=255 && $ips[3]>=0 && $ips[3]<=255 )$oper = "30";
//212.113.54.0 - 212.113.54.255
if($ips[0]==212 && $ips[1]==113 && $ips[2]==54 && $ips[3]>=0 && $ips[3]<=255 )$oper = "30";
//213.186.108.0 - 213.186.108.255
if($ips[0]==213 && $ips[1]==186 && $ips[2]==108 && $ips[3]>=0 && $ips[3]<=255 )$oper = "30";
//212.113.56.0 - 212.113.63.255
if($ips[0]==212 && $ips[1]==113 &&$ips[2]>=56 && $ips[2]<=63 && $ips[3]>=0 && $ips[3]<=255 )$oper = "30";
//213.186.111.0 - 213.186.111.255
if($ips[0]==213 && $ips[1]==186 &&$ips[2]==111 && $ips[3]>=0 && $ips[3]<=255 )$oper = "30";
//213.186.109.0 - 213.186.109.255
if($ips[0]==213 && $ips[1]==186 &&$ips[2]==109 && $ips[3]>=0 && $ips[3]<=255 )$oper = "30";
//213.186.107.0 - 213.186.107.255
if($ips[0]==213 && $ips[1]==186 &&$ips[2]==107 && $ips[3]>=0 && $ips[3]<=255 )$oper = "30";
// 213.186.99.0 - 213.186.99.255
if($ips[0]==213 && $ips[1]==186 &&$ips[2]==99 && $ips[3]>=0 && $ips[3]<=255 )$oper = "30";
//213.186.110.0 - 213.186.110.255
if($ips[0]==213 && $ips[1]==186 &&$ips[2]==110 && $ips[3]>=0 && $ips[3]<=255 )$oper = "30";
//////////
  for ($ix=0; $ix<count($IP310); $ix++)        {   if ($ipnum>=$IP310[$ix] && $ipnum<=$IP311[$ix]) $oper = "31"; }
  if (ereg('Opera Mini', $_SERVER['HTTP_USER_AGENT'])){$oper = "32";}
  for ($ix=0; $ix<count($IP314); $ix++)        {   if ($ipnum>=$IP314[$ix] && $ipnum<=$IP315[$ix]) $oper = "33"; }
  for ($ix=0; $ix<count($IP316); $ix++)        {   if ($ipnum>=$IP316[$ix] && $ipnum<=$IP317[$ix]) $oper = "34"; }
  for ($ix=0; $ix<count($IP318); $ix++)        {         if ($ipnum>=$IP318[$ix] && $ipnum<=$IP319[$ix]) $oper = "35";        }
        for ($ix=0; $ix<count($IP320); $ix++)        {         if ($ipnum>=$IP320[$ix] && $ipnum<=$IP321[$ix]) $oper = "36"; }
        for ($ix=0; $ix<count($IP322); $ix++)        {         if ($ipnum>=$IP322[$ix] && $ipnum<=$IP323[$ix]) $oper = "37";        }
        for ($ix=0; $ix<count($IP324); $ix++)        {          if ($ipnum>=$IP324[$ix] && $ipnum<=$IP325[$ix]) $oper = "38";        }
        for ($ix=0; $ix<count($IP326); $ix++)        {         if ($ipnum>=$IP326[$ix] && $ipnum<=$IP327[$ix]) $oper = "39";        }
        for ($ix=0; $ix<count($IP328); $ix++)        {          if ($ipnum>=$IP328[$ix] && $ipnum<=$IP329[$ix]) $oper = "40";        }
        for ($ix=0; $ix<count($IP330); $ix++)        {   if ($ipnum>=$IP330[$ix] && $ipnum<=$IP331[$ix]) $oper = "41";        }
        for ($ix=0; $ix<count($IP332); $ix++)        {          if ($ipnum>=$IP332[$ix] && $ipnum<=$IP333[$ix]) $oper = "42";        }
        for ($ix=0; $ix<count($IP334); $ix++)        {         if ($ipnum>=$IP334[$ix] && $ipnum<=$IP335[$ix]) $oper = "43";        }
        for ($ix=0; $ix<count($IP336); $ix++)        {          if ($ipnum>=$IP336[$ix] && $ipnum<=$IP337[$ix]) $oper = "44";        }
        for ($ix=0; $ix<count($IP338); $ix++)        {         if ($ipnum>=$IP338[$ix] && $ipnum<=$IP339[$ix]) $oper = "45";        }
        for ($ix=0; $ix<count($IP340); $ix++)        {          if ($ipnum>=$IP340[$ix] && $ipnum<=$IP341[$ix]) $oper = "46";        }
        for ($ix=0; $ix<count($IP342); $ix++)        {          if ($ipnum>=$IP342[$ix] && $ipnum<=$IP343[$ix]) $oper = "47";        }
        for ($ix=0; $ix<count($IP344); $ix++)        {         if ($ipnum>=$IP344[$ix] && $ipnum<=$IP345[$ix]) $oper = "48";        }
        for ($ix=0; $ix<count($IP346); $ix++)        {         if ($ipnum>=$IP346[$ix] && $ipnum<=$IP347[$ix]) $oper = "49";        }
        for ($ix=0; $ix<count($IP348); $ix++)        {         if ($ipnum>=$IP348[$ix] && $ipnum<=$IP349[$ix]) $oper = "50";        }
        for ($ix=0; $ix<count($IP350); $ix++)        {         if ($ipnum>=$IP350[$ix] && $ipnum<=$IP351[$ix]) $oper = "51";        }
        for ($ix=0; $ix<count($IP352); $ix++)        {         if ($ipnum>=$IP352[$ix] && $ipnum<=$IP353[$ix]) $oper = "52";        }
        for ($ix=0; $ix<count($IP354); $ix++)        {         if ($ipnum>=$IP354[$ix] && $ipnum<=$IP355[$ix]) $oper = "53";        }
        for ($ix=0; $ix<count($IP356); $ix++)        {         if ($ipnum>=$IP356[$ix] && $ipnum<=$IP357[$ix]) $oper = "54";        }
        for ($ix=0; $ix<count($IP358); $ix++)        {         if ($ipnum>=$IP358[$ix] && $ipnum<=$IP359[$ix]) $oper = "55";        }
        for ($ix=0; $ix<count($IP360); $ix++)        {         if ($ipnum>=$IP360[$ix] && $ipnum<=$IP361[$ix]) $oper = "56";        }
        for ($ix=0; $ix<count($IP362); $ix++)        {         if ($ipnum>=$IP362[$ix] && $ipnum<=$IP363[$ix]) $oper = "57";        }
        for ($ix=0; $ix<count($IP364); $ix++)        {         if ($ipnum>=$IP364[$ix] && $ipnum<=$IP365[$ix]) $oper = "58";        }
        for ($ix=0; $ix<count($IP366); $ix++)        {         if ($ipnum>=$IP366[$ix] && $ipnum<=$IP367[$ix]) $oper = "59";        }
        for ($ix=0; $ix<count($IP368); $ix++)        {         if ($ipnum>=$IP368[$ix] && $ipnum<=$IP369[$ix]) $oper = "60";        }
        for ($ix=0; $ix<count($IP370); $ix++)        {         if ($ipnum>=$IP370[$ix] && $ipnum<=$IP371[$ix]) $oper = "61";        }
        for ($ix=0; $ix<count($IP372); $ix++)        {         if ($ipnum>=$IP372[$ix] && $ipnum<=$IP373[$ix]) $oper = "62";        }
        for ($ix=0; $ix<count($IP374); $ix++)        {         if ($ipnum>=$IP374[$ix] && $ipnum<=$IP375[$ix]) $oper = "63";        }
        for ($ix=0; $ix<count($IP376); $ix++)        {         if ($ipnum>=$IP376[$ix] && $ipnum<=$IP377[$ix]) $oper = "64";        }
        for ($ix=0; $ix<count($IP378); $ix++)        {         if ($ipnum>=$IP378[$ix] && $ipnum<=$IP379[$ix]) $oper = "65";        }
        for ($ix=0; $ix<count($IP380); $ix++)        {         if ($ipnum>=$IP380[$ix] && $ipnum<=$IP381[$ix]) $oper = "66";        }
        for ($ix=0; $ix<count($IP382); $ix++)        {         if ($ipnum>=$IP382[$ix] && $ipnum<=$IP383[$ix]) $oper = "67";        }
        for ($ix=0; $ix<count($IP384); $ix++)        {         if ($ipnum>=$IP384[$ix] && $ipnum<=$IP385[$ix]) $oper = "68";        }
        for ($ix=0; $ix<count($IP386); $ix++)        {         if ($ipnum>=$IP386[$ix] && $ipnum<=$IP387[$ix]) $oper = "69";        }
        for ($ix=0; $ix<count($IP388); $ix++)        {         if ($ipnum>=$IP388[$ix] && $ipnum<=$IP389[$ix]) $oper = "70";        }
        for ($ix=0; $ix<count($IP390); $ix++)        {         if ($ipnum>=$IP390[$ix] && $ipnum<=$IP391[$ix]) $oper = "71";        }
        for ($ix=0; $ix<count($IP392); $ix++)        {         if ($ipnum>=$IP392[$ix] && $ipnum<=$IP393[$ix]) $oper = "72";        }
        for ($ix=0; $ix<count($IP394); $ix++)        {         if ($ipnum>=$IP394[$ix] && $ipnum<=$IP395[$ix]) $oper = "73";        }
        for ($ix=0; $ix<count($IP396); $ix++)        {         if ($ipnum>=$IP396[$ix] && $ipnum<=$IP397[$ix]) $oper = "74";        }
        for ($ix=0; $ix<count($IP398); $ix++)        {         if ($ipnum>=$IP398[$ix] && $ipnum<=$IP399[$ix]) $oper = "75";        }
        for ($ix=0; $ix<count($IP400); $ix++)        {         if ($ipnum>=$IP400[$ix] && $ipnum<=$IP401[$ix]) $oper = "76";        }
        for ($ix=0; $ix<count($IP402); $ix++)        {         if ($ipnum>=$IP402[$ix] && $ipnum<=$IP403[$ix]) $oper = "77";        }
        for ($ix=0; $ix<count($IP404); $ix++)        {         if ($ipnum>=$IP404[$ix] && $ipnum<=$IP405[$ix]) $oper = "78";        }
        for ($ix=0; $ix<count($IP406); $ix++)        {         if ($ipnum>=$IP406[$ix] && $ipnum<=$IP407[$ix]) $oper = "79";        }
        for ($ix=0; $ix<count($IP408); $ix++)        {         if ($ipnum>=$IP408[$ix] && $ipnum<=$IP409[$ix]) $oper = "80";        }
        for ($ix=0; $ix<count($IP410); $ix++)        {         if ($ipnum>=$IP410[$ix] && $ipnum<=$IP411[$ix]) $oper = "81";        }
        for ($ix=0; $ix<count($IP412); $ix++)        {         if ($ipnum>=$IP412[$ix] && $ipnum<=$IP413[$ix]) $oper = "82";        }
        for ($ix=0; $ix<count($IP414); $ix++)        {         if ($ipnum>=$IP414[$ix] && $ipnum<=$IP415[$ix]) $oper = "83";        }
        for ($ix=0; $ix<count($IP416); $ix++)        {         if ($ipnum>=$IP416[$ix] && $ipnum<=$IP417[$ix]) $oper = "84";        }
        for ($ix=0; $ix<count($IP418); $ix++)        {         if ($ipnum>=$IP418[$ix] && $ipnum<=$IP419[$ix]) $oper = "85";        }
        for ($ix=0; $ix<count($IP420); $ix++)        {         if ($ipnum>=$IP420[$ix] && $ipnum<=$IP421[$ix]) $oper = "86";        }
        for ($ix=0; $ix<count($IP422); $ix++)        {         if ($ipnum>=$IP422[$ix] && $ipnum<=$IP423[$ix]) $oper = "87";        }
        for ($ix=0; $ix<count($IP424); $ix++)        {          if ($ipnum>=$IP424[$ix] && $ipnum<=$IP425[$ix]) $oper = "88";        }
        for ($ix=0; $ix<count($IP426); $ix++)        {         if ($ipnum>=$IP426[$ix] && $ipnum<=$IP427[$ix]) $oper = "89";        }
        for ($ix=0; $ix<count($IP428); $ix++)        {         if ($ipnum>=$IP428[$ix] && $ipnum<=$IP429[$ix]) $oper = "90";        }
        for ($ix=0; $ix<count($IP430); $ix++)        {         if ($ipnum>=$IP430[$ix] && $ipnum<=$IP431[$ix]) $oper = "91";        }
        for ($ix=0; $ix<count($IP432); $ix++)        {         if ($ipnum>=$IP432[$ix] && $ipnum<=$IP433[$ix]) $oper = "92";        }
         for ($ix=0; $ix<count($IP434); $ix++)        {         if ($ipnum>=$IP434[$ix] && $ipnum<=$IP435[$ix]) $oper = "93";        }
        for ($ix=0; $ix<count($IP436); $ix++)        {         if ($ipnum>=$IP436[$ix] && $ipnum<=$IP437[$ix]) $oper = "94";        }
        for ($ix=0; $ix<count($IP438); $ix++)        {         if ($ipnum>=$IP438[$ix] && $ipnum<=$IP439[$ix]) $oper = "95";        }
        for ($ix=0; $ix<count($IP440); $ix++)        {         if ($ipnum>=$IP440[$ix] && $ipnum<=$IP441[$ix]) $oper = "96";        }
        for ($ix=0; $ix<count($IP442); $ix++)        {         if ($ipnum>=$IP442[$ix] && $ipnum<=$IP443[$ix]) $oper = "97";        }
        for ($ix=0; $ix<count($IP444); $ix++)        {         if ($ipnum>=$IP444[$ix] && $ipnum<=$IP445[$ix]) $oper = "98";        }
        for ($ix=0; $ix<count($IP446); $ix++)        {         if ($ipnum>=$IP446[$ix] && $ipnum<=$IP447[$ix]) $oper = "99";        }
        for ($ix=0; $ix<count($IP448); $ix++)        {         if ($ipnum>=$IP448[$ix] && $ipnum<=$IP449[$ix]) $oper = "100";        }
        for ($ix=0; $ix<count($IP450); $ix++)        {         if ($ipnum>=$IP450[$ix] && $ipnum<=$IP451[$ix]) $oper = "101"; }
        for ($ix=0; $ix<count($IP452); $ix++)        {         if ($ipnum>=$IP452[$ix] && $ipnum<=$IP453[$ix]) $oper = "102";        }
        for ($ix=0; $ix<count($IP454); $ix++)        {         if ($ipnum>=$IP454[$ix] && $ipnum<=$IP455[$ix]) $oper = "103";        }
        for ($ix=0; $ix<count($IP456); $ix++)        {         if ($ipnum>=$IP456[$ix] && $ipnum<=$IP457[$ix]) $oper = "104";        }
        for ($ix=0; $ix<count($IP458); $ix++)        {         if ($ipnum>=$IP458[$ix] && $ipnum<=$IP459[$ix]) $oper = "105";        }
        for ($ix=0; $ix<count($IP460); $ix++)        {         if ($ipnum>=$IP460[$ix] && $ipnum<=$IP461[$ix]) $oper = "106";        }
        for ($ix=0; $ix<count($IP462); $ix++)        {         if ($ipnum>=$IP462[$ix] && $ipnum<=$IP463[$ix]) $oper = "107";        }
        for ($ix=0; $ix<count($IP464); $ix++)        {         if ($ipnum>=$IP464[$ix] && $ipnum<=$IP465[$ix]) $oper = "108";        }
        for ($ix=0; $ix<count($IP466); $ix++)        {         if ($ipnum>=$IP466[$ix] && $ipnum<=$IP467[$ix]) $oper = "109";        }
        for ($ix=0; $ix<count($IP468); $ix++)        {         if ($ipnum>=$IP468[$ix] && $ipnum<=$IP469[$ix]) $oper = "110";        }
        for ($ix=0; $ix<count($IP470); $ix++)        {         if ($ipnum>=$IP470[$ix] && $ipnum<=$IP471[$ix]) $oper = "111";        }
        for ($ix=0; $ix<count($IP472); $ix++)        {         if ($ipnum>=$IP472[$ix] && $ipnum<=$IP473[$ix]) $oper = "112";        }
        for ($ix=0; $ix<count($IP474); $ix++)        {         if ($ipnum>=$IP474[$ix] && $ipnum<=$IP475[$ix]) $oper = "113";        }
        for ($ix=0; $ix<count($IP476); $ix++)        {         if ($ipnum>=$IP476[$ix] && $ipnum<=$IP477[$ix]) $oper = "114";        }
        for ($ix=0; $ix<count($IP478); $ix++)        {         if ($ipnum>=$IP478[$ix] && $ipnum<=$IP479[$ix]) $oper = "115";        }
        for ($ix=0; $ix<count($IP480); $ix++)        {         if ($ipnum>=$IP480[$ix] && $ipnum<=$IP481[$ix]) $oper = "116";        }
 for ($ix=0; $ix<count($IP308); $ix++)        {   if ($ipnum>=$IP308[$ix] && $ipnum<=$IP309[$ix]) $oper = "117"; }
  if (ereg('Windows', $_SERVER['HTTP_USER_AGENT'])){$oper = "118";}


if($oper == 1)$oper_name = "Мегафон (Россия)";
if($oper == 2)$oper_name = "Билайн (Россия)";
if($oper == 3)$oper_name = "Utel (Россия)";
if($oper == 4)$oper_name = "БайкалВестКом (Россия)";
if($oper == 5)$oper_name = "МТС (Россия)";
if($oper == 6)$oper_name = "TELE2 (Россия)";
if($oper == 7)$oper_name = "МОТИВ (Россия)";
if($oper == 8)$oper_name = "Енисейтелеком (Россия)";
if($oper == 9)$oper_name = "НСС (Россия)";
if($oper == 10)$oper_name = "СМАРТС (Россия)";
if($oper == 11)$oper_name = "СТЕК GSM (Россия)";
if($oper == 12)$oper_name = "Татинком-Т (Россия)";
if($oper == 13)$oper_name = "Ульяновск GSM (Россия)";
if($oper == 14)$oper_name = "НТК (Россия)";
if($oper == 15)$oper_name = "СКАЙЛИНК (Россия)";
if($oper == 16)$oper_name = "Цифровая экспансия (Россия)";
if($oper == 17)$oper_name = "ИНДИГО (Таджикистан)";
if($oper == 18)$oper_name = "Emt (Эстония)";
if($oper == 19)$oper_name = "Elisa (Эстония)";
if($oper == 20)$oper_name = "Tele-2 (Эстония)";
if($oper == 21)$oper_name = "Bite (Литва)";
if($oper == 22)$oper_name = "Omnitel (Литва)";
if($oper == 23)$oper_name = "Tele-2 (Литва)";
if($oper == 24)$oper_name = "Tele-2 (Латвия)";
if($oper == 25)$oper_name = "Lmt (Латвия)";
if($oper == 26)$oper_name = "Киевстар (Украина)";
if($oper == 27)$oper_name = "UMC (Украина)";
if($oper == 28)$oper_name = "life:) (Украина)";
if($oper == 29)$oper_name = "WellCOM (Украина)";
if($oper == 30)$oper_name = "UTEL (Украина)";
if($oper == 31)$oper_name = "Прибалтийские операторы";
if($oper == 32)$oper_name = "Opera Mini";
if($oper == 33)$oper_name = "Beeline (Казахстан)";
if($oper == 34)$oper_name = "Экстел GSM ";
if($oper == 35)$oper_name = "Babilon GSM (Таджикистан)";
if($oper == 36)$oper_name = "БеСТ (Беларусь)";
if($oper == 37)$oper_name = "Сотовая Связь Улан-Уде (Россия)";
if($oper == 38)$oper_name = "AQUAFON Абхазия-GSM (Россия)";
if($oper == 39)$oper_name = "MegaCom KG (Киргизия)";
if($oper == 40)$oper_name = "Kyrgyztelecom (Киргизия)";
if($oper == 41)$oper_name = "BiTel (Киргизия)";
if($oper == 42)$oper_name = "ON GSM (Россия)";
if($oper == 43)$oper_name = "VELCOM (Белорусь)";
if($oper == 44)$oper_name = "Алтайсвязь (Россия)";
if($oper == 45)$oper_name = "Тамбов GSM (Россия)";
if($oper == 46)$oper_name = "БашСел (Россия)";
if($oper == 47)$oper_name = "ДальСвязь (Россия)";
if($oper == 48)$oper_name = "Оренбург GSM (Россия)";
if($oper == 49)$oper_name = "Скай Мобайл (Россия)";
if($oper == 50)$oper_name = "УралСвязьИнформ (Россия)";
if($oper == 51)$oper_name = "MLT (Tаджикистан)";
if($oper == 52)$oper_name = "BiMoCom";
if($oper == 53)$oper_name = "K-Mobile";
if($oper == 54)$oper_name = "MTN (ЮАР)";
if($oper == 55)$oper_name = "Cell (ЮАР)";
if($oper == 56)$oper_name = "Vodacom (ЮАР)";
if($oper == 57)$oper_name = "Magticom (Грузия)";
if($oper == 58)$oper_name = "Geocell (Грузия)";
if($oper == 59)$oper_name = "Orange (Израиль)";
if($oper == 60)$oper_name = "Cellcom (Израиль)";
if($oper == 61)$oper_name = "Voxtel GSM (Молдова)";
if($oper == 62)$oper_name = "Moldcell (Молдова)";
if($oper == 63)$oper_name = "GLOBUL (Болгария)";
if($oper == 64)$oper_name = "M-TEL GSM (Болгария)";
if($oper == 65)$oper_name = "China Mobile (Китай)";
if($oper == 66)$oper_name = "Orange (Румыния)";
if($oper == 67)$oper_name = "Vodafone (Румыния)";
if($oper == 68)$oper_name = "Indosat (Индонезия)";
if($oper == 69)$oper_name = "proXL (Индонезия)";
if($oper == 70)$oper_name = "T-SEL (Индонезия)";
if($oper == 71)$oper_name = "Orange (Франция)";
if($oper == 72)$oper_name = "SFR (Франция)";
if($oper == 73)$oper_name = "Bouygues Telecom (Франция)";
if($oper == 74)$oper_name = "Orange (Великобритания)";
if($oper == 75)$oper_name = "O2 (Великобритания)";
if($oper == 76)$oper_name = "T-Mobile (Великобритания)";
if($oper == 77)$oper_name = "Dishnet (Индия)";
if($oper == 78)$oper_name = "Vodafone (Великобритания)";
if($oper == 79)$oper_name = "HUTCH (Индия)";
if($oper == 80)$oper_name = "idEA (Индия)";
if($oper == 81)$oper_name = "MTNL (Индия)";
if($oper == 82)$oper_name = "АКОС (Россия)";
if($oper == 83)$oper_name = "Airtel (Индия)";
if($oper == 84)$oper_name = "Vodafone (Италия)";
if($oper == 85)$oper_name = "Telecom Italia Mobile (Италия)";
if($oper == 86)$oper_name = "T-Mobile (США)";
if($oper == 87)$oper_name = "AT T (США)";
if($oper == 88)$oper_name = "Mobilkom (Австрия)";
if($oper == 89)$oper_name = "Azercell Telecom (Aзербайджан)";
if($oper == 90)$oper_name = "Bakcell (Aзербайджан)";
if($oper == 91)$oper_name = "Nar Mobile (Aзебайджан)";
if($oper == 92)$oper_name = "Topnet 3G (Сербия и Черногория)";
if($oper == 93)$oper_name = "TELEKOM SRBIJA (Сербия и Черногория)";
if($oper == 94)$oper_name = "MOBTEL (Югославия)";
if($oper == 95)$oper_name = "Vodafone (Ирландия)";
if($oper == 96)$oper_name = "Vipnet (Хорватия)";
if($oper == 97)$oper_name = "Vivacell (Армения)";
if($oper == 98)$oper_name = "E-Plus (Германия)";
if($oper == 99)$oper_name = "O2 DE (Германия)";
if($oper == 100)$oper_name = "T-Mobile DE (Германия)";
if($oper == 101)$oper_name = "Vodafone DE (Германия)";
if($oper == 102)$oper_name = "WIND (Италия)";
if($oper == 103)$oper_name = "Eventis (Молдавия)";
if($oper == 104)$oper_name = "Vodafone (Испания)";
if($oper == 105)$oper_name = "Orange (Испания)";
if($oper == 106)$oper_name = "Euskaltel (Испания)";
if($oper == 107)$oper_name = "R (Испания)";
if($oper == 108)$oper_name = "Telecable (Испания)";
if($oper == 109)$oper_name = "KPN (Голландия)";
if($oper == 110)$oper_name = "T-Mobile (Голландия)";
if($oper == 111)$oper_name = "Vodafone (Голландия)";
if($oper == 112)$oper_name = "Orange (Голландия)";
if($oper == 113)$oper_name = "Telfort (Голландия)";
if($oper == 114)$oper_name = "Tele2 (Голландия)";
if($oper == 115)$oper_name = "O2 (Чехия)";
if($oper == 116)$oper_name = "T-Mobile (Чехия)";
if($oper == 117)$oper_name = "KCELL (Казахстан)";
if($oper == 118)$oper_name = "Компьютеры";}
//////
///////////////тип устройства
$brauzer="cell";
    if (strpos($usa, "UNTRUSTED") !== false)$brauzer = "comp";

                if (strpos($usa, "Untrusted") !== false)$brauzer = "comp";

                if (strpos($usa, "M3Gate") !== false)$brauzer = "comp";

                if (strpos($usa, "emulator") !== false)$brauzer = "comp";

                if (strpos($usa, "WinWAP") !== false)$brauzer = "comp";

                if (strpos($usa, "Wapsilon") !== false)$brauzer = "comp";

                if (strpos($usa, "M3GATE") !== false)$brauzer = "comp";

    if (strpos($usa, "Opera") !== false)$brauzer = "opera";

                if (strpos($usa, "Opera Mini") !== false)$brauzer = "opera";

                if (strpos($usa, "Mozilla") !== false)$brauzer = "comp";

                if (strpos($usa, "Windows") !== false)$brauzer = "comp";
?>