<?php
require '../inc/sys.php';

echo "
<div class='p_m'>
<img src='/guard/icons/help.png' alt='' /> Для того, что бы найти все вирусы на Вашем сайте, нажмите &quot;Сканировать сайт&quot;<br />
<img src='/guard/icons/help.png' alt='' /> Что бы проверить папки по отдельности, нажмите &quot;Сканировать папку&quot;<br />
<img src='/guard/icons/help.png' alt='' /> Если при старте сканирования сайта процесс стоит на месте, попробуйте обновлять страницу вручную или поставить на автообновление<br />
<img src='/guard/icons/help.png' alt='' /> Во время проверки сайта Вы можете приостановить процесс, нажав на кнопку <img src='/guard/icons/off.png' width='16' height='16' alt='' /> рядом с линеей прогресса<br />
<img src='/guard/icons/help.png' alt='' /> Если файл не является вредоносным, добавьте его в исключения, нажав на иконку <img src='/guard/icons/accept_24.png' width='16' height='16' alt='' /> справа от адреса файла<br />
<img src='/guard/icons/help.png' alt='' /> Список всех исключенных из сканирования файлов можно увидеть, перейдя по ссылке &quot;Исключения из сканирования&quot; <br />
<img src='/guard/icons/help.png' alt='' /> Есть функция просмотра содержимого файлов не выходя из браузера, этого нажмите на кнопку рядом с файлом <img src='/guard/icons/read_24.png' width='16' height='16' alt='' /> справа от него<br />
<img src='/guard/icons/help.png' alt='' /> Вы можете скачать результаты сканирования, нажав &quot;Скачать результаты сканирования&quot;<br />
<img src='/guard/icons/help.png' alt='' /> Внизу главной страницы модуля показываются не обработанные подозрительные файлы с последнего сеанса
</div>";